/** 2022-23 年节假日 */
export const week = [
  {
    date: '2022-01-08',
    remark: '周六',
  },
  {
    date: '2022-01-09',
    remark: '周日',
  },
  {
    date: '2022-01-15',
    remark: '周六',
  },
  {
    date: '2022-01-16',
    remark: '周日',
  },
  {
    date: '2022-01-22',
    remark: '周六',
  },
  {
    date: '2022-01-23',
    remark: '周日',
  },
  {
    date: '2022-02-12',
    remark: '周六',
  },
  {
    date: '2022-02-13',
    remark: '周日',
  },
  {
    date: '2022-02-19',
    remark: '周六',
  },
  {
    date: '2022-02-20',
    remark: '周日',
  },
  {
    date: '2022-02-26',
    remark: '周六',
  },
  {
    date: '2022-02-27',
    remark: '周日',
  },
  {
    date: '2022-03-05',
    remark: '周六',
  },
  {
    date: '2022-03-06',
    remark: '周日',
  },
  {
    date: '2022-03-12',
    remark: '周六',
  },
  {
    date: '2022-03-13',
    remark: '周日',
  },
  {
    date: '2022-03-19',
    remark: '周六',
  },
  {
    date: '2022-03-20',
    remark: '周日',
  },
  {
    date: '2022-03-26',
    remark: '周六',
  },
  {
    date: '2022-03-27',
    remark: '周日',
  },
  {
    date: '2022-04-09',
    remark: '周六',
  },
  {
    date: '2022-04-10',
    remark: '周日',
  },
  {
    date: '2022-04-16',
    remark: '周六',
  },
  {
    date: '2022-04-17',
    remark: '周日',
  },
  {
    date: '2022-04-23',
    remark: '周六',
  },
  {
    date: '2022-05-08',
    remark: '周日',
  },
  {
    date: '2022-05-14',
    remark: '周六',
  },
  {
    date: '2022-05-15',
    remark: '周日',
  },
  {
    date: '2022-05-21',
    remark: '周六',
  },
  {
    date: '2022-05-22',
    remark: '周日',
  },
  {
    date: '2022-05-28',
    remark: '周六',
  },
  {
    date: '2022-05-29',
    remark: '周日',
  },
  {
    date: '2022-06-11',
    remark: '周六',
  },
  {
    date: '2022-06-12',
    remark: '周日',
  },
  {
    date: '2022-06-18',
    remark: '周六',
  },
  {
    date: '2022-06-19',
    remark: '周日',
  },
  {
    date: '2022-06-25',
    remark: '周六',
  },
  {
    date: '2022-06-26',
    remark: '周日',
  },
  {
    date: '2022-07-02',
    remark: '周六',
  },
  {
    date: '2022-07-03',
    remark: '周日',
  },
  {
    date: '2022-07-09',
    remark: '周六',
  },
  {
    date: '2022-07-10',
    remark: '周日',
  },
  {
    date: '2022-07-16',
    remark: '周六',
  },
  {
    date: '2022-07-17',
    remark: '周日',
  },
  {
    date: '2022-07-23',
    remark: '周六',
  },
  {
    date: '2022-07-24',
    remark: '周日',
  },
  {
    date: '2022-07-30',
    remark: '周六',
  },
  {
    date: '2022-07-31',
    remark: '周日',
  },
  {
    date: '2022-08-06',
    remark: '周六',
  },
  {
    date: '2022-08-07',
    remark: '周日',
  },
  {
    date: '2022-08-13',
    remark: '周六',
  },
  {
    date: '2022-08-14',
    remark: '周日',
  },
  {
    date: '2022-08-20',
    remark: '周六',
  },
  {
    date: '2022-08-21',
    remark: '周日',
  },
  {
    date: '2022-08-27',
    remark: '周六',
  },
  {
    date: '2022-08-28',
    remark: '周日',
  },
  {
    date: '2022-09-03',
    remark: '周六',
  },
  {
    date: '2022-09-04',
    remark: '周日',
  },
  {
    date: '2022-09-17',
    remark: '周六',
  },
  {
    date: '2022-09-18',
    remark: '周日',
  },
  {
    date: '2022-09-24',
    remark: '周六',
  },
  {
    date: '2022-09-25',
    remark: '周日',
  },
  {
    date: '2022-10-15',
    remark: '周六',
  },
  {
    date: '2022-10-16',
    remark: '周日',
  },
  {
    date: '2022-10-22',
    remark: '周六',
  },
  {
    date: '2022-10-23',
    remark: '周日',
  },
  {
    date: '2022-10-29',
    remark: '周六',
  },
  {
    date: '2022-10-30',
    remark: '周日',
  },
  {
    date: '2022-11-05',
    remark: '周六',
  },
  {
    date: '2022-11-06',
    remark: '周日',
  },
  {
    date: '2022-11-12',
    remark: '周六',
  },
  {
    date: '2022-11-13',
    remark: '周日',
  },
  {
    date: '2022-11-19',
    remark: '周六',
  },
  {
    date: '2022-11-20',
    remark: '周日',
  },
  {
    date: '2022-11-26',
    remark: '周六',
  },
  {
    date: '2022-11-27',
    remark: '周日',
  },
  {
    date: '2022-12-03',
    remark: '周六',
  },
  {
    date: '2022-12-04',
    remark: '周日',
  },
  {
    date: '2022-12-10',
    remark: '周六',
  },
  {
    date: '2022-12-11',
    remark: '周日',
  },
  {
    date: '2022-12-17',
    remark: '周六',
  },
  {
    date: '2022-12-18',
    remark: '周日',
  },
  {
    date: '2022-12-24',
    remark: '周六',
  },
  {
    date: '2022-12-25',
    remark: '周日',
  },
  {
    date: '2023-01-07',
    remark: '周六',
  },
  {
    date: '2023-01-08',
    remark: '周日',
  },
  {
    date: '2023-01-14',
    remark: '周六',
  },
  {
    date: '2023-01-15',
    remark: '周日',
  },
  {
    date: '2023-02-04',
    remark: '周六',
  },
  {
    date: '2023-02-05',
    remark: '周日',
  },
  {
    date: '2023-02-11',
    remark: '周六',
  },
  {
    date: '2023-02-12',
    remark: '周日',
  },
  {
    date: '2023-02-18',
    remark: '周六',
  },
  {
    date: '2023-02-19',
    remark: '周日',
  },
  {
    date: '2023-02-25',
    remark: '周六',
  },
  {
    date: '2023-02-26',
    remark: '周日',
  },
  {
    date: '2023-03-04',
    remark: '周六',
  },
  {
    date: '2023-03-05',
    remark: '周日',
  },
  {
    date: '2023-03-11',
    remark: '周六',
  },
  {
    date: '2023-03-12',
    remark: '周日',
  },
  {
    date: '2023-03-18',
    remark: '周六',
  },
  {
    date: '2023-03-19',
    remark: '周日',
  },
  {
    date: '2023-03-25',
    remark: '周六',
  },
  {
    date: '2023-03-26',
    remark: '周日',
  },
  {
    date: '2023-04-01',
    remark: '周六',
  },
  {
    date: '2023-04-02',
    remark: '周日',
  },
  {
    date: '2023-04-08',
    remark: '周六',
  },
  {
    date: '2023-04-09',
    remark: '周日',
  },
  {
    date: '2023-04-15',
    remark: '周六',
  },
  {
    date: '2023-04-16',
    remark: '周日',
  },
  {
    date: '2023-04-22',
    remark: '周六',
  },
  {
    date: '2023-05-07',
    remark: '周日',
  },
  {
    date: '2023-05-13',
    remark: '周六',
  },
  {
    date: '2023-05-14',
    remark: '周日',
  },
  {
    date: '2023-05-20',
    remark: '周六',
  },
  {
    date: '2023-05-21',
    remark: '周日',
  },
  {
    date: '2023-05-27',
    remark: '周六',
  },
  {
    date: '2023-05-28',
    remark: '周日',
  },
  {
    date: '2023-06-03',
    remark: '周六',
  },
  {
    date: '2023-06-04',
    remark: '周日',
  },
  {
    date: '2023-06-10',
    remark: '周六',
  },
  {
    date: '2023-06-11',
    remark: '周日',
  },
  {
    date: '2023-06-17',
    remark: '周六',
  },
  {
    date: '2023-06-18',
    remark: '周日',
  },
  {
    date: '2023-07-01',
    remark: '周六',
  },
  {
    date: '2023-07-02',
    remark: '周日',
  },
  {
    date: '2023-07-08',
    remark: '周六',
  },
  {
    date: '2023-07-09',
    remark: '周日',
  },
  {
    date: '2023-07-15',
    remark: '周六',
  },
  {
    date: '2023-07-16',
    remark: '周日',
  },
  {
    date: '2023-07-22',
    remark: '周六',
  },
  {
    date: '2023-07-23',
    remark: '周日',
  },
  {
    date: '2023-07-29',
    remark: '周六',
  },
  {
    date: '2023-07-30',
    remark: '周日',
  },
  {
    date: '2023-08-05',
    remark: '周六',
  },
  {
    date: '2023-08-06',
    remark: '周日',
  },
  {
    date: '2023-08-12',
    remark: '周六',
  },
  {
    date: '2023-08-13',
    remark: '周日',
  },
  {
    date: '2023-08-19',
    remark: '周六',
  },
  {
    date: '2023-08-20',
    remark: '周日',
  },
  {
    date: '2023-08-26',
    remark: '周六',
  },
  {
    date: '2023-08-27',
    remark: '周日',
  },
  {
    date: '2023-09-02',
    remark: '周六',
  },
  {
    date: '2023-09-03',
    remark: '周日',
  },
  {
    date: '2023-09-09',
    remark: '周六',
  },
  {
    date: '2023-09-10',
    remark: '周日',
  },
  {
    date: '2023-09-16',
    remark: '周六',
  },
  {
    date: '2023-09-17',
    remark: '周日',
  },
  {
    date: '2023-09-23',
    remark: '周六',
  },
  {
    date: '2023-09-24',
    remark: '周日',
  },
  {
    date: '2023-10-14',
    remark: '周六',
  },
  {
    date: '2023-10-15',
    remark: '周日',
  },
  {
    date: '2023-10-21',
    remark: '周六',
  },
  {
    date: '2023-10-22',
    remark: '周日',
  },
  {
    date: '2023-10-28',
    remark: '周六',
  },
  {
    date: '2023-10-29',
    remark: '周日',
  },
  {
    date: '2023-11-04',
    remark: '周六',
  },
  {
    date: '2023-11-05',
    remark: '周日',
  },
  {
    date: '2023-11-11',
    remark: '周六',
  },
  {
    date: '2023-11-12',
    remark: '周日',
  },
  {
    date: '2023-11-18',
    remark: '周六',
  },
  {
    date: '2023-11-19',
    remark: '周日',
  },
  {
    date: '2023-11-25',
    remark: '周六',
  },
  {
    date: '2023-11-26',
    remark: '周日',
  },
  {
    date: '2023-12-02',
    remark: '周六',
  },
  {
    date: '2023-12-03',
    remark: '周日',
  },
  {
    date: '2023-12-09',
    remark: '周六',
  },
  {
    date: '2023-12-10',
    remark: '周日',
  },
  {
    date: '2023-12-16',
    remark: '周六',
  },
  {
    date: '2023-12-17',
    remark: '周日',
  },
  {
    date: '2023-12-23',
    remark: '周六',
  },
  {
    date: '2023-12-24',
    remark: '周日',
  },
  {
    date: '2023-12-30',
    remark: '周六',
  },
  {
    date: '2023-12-31',
    remark: '周日',
  },
  {
    date: '2022-01-01',
    remark: '元旦',
  },
  {
    date: '2022-01-02',
    remark: '元旦',
  },
  {
    date: '2022-01-03',
    remark: '元旦',
  },
  {
    date: '2022-01-31',
    remark: '除夕',
  },
  {
    date: '2022-02-01',
    remark: '初一',
  },
  {
    date: '2022-02-02',
    remark: '初二',
  },
  {
    date: '2022-02-03',
    remark: '初三',
  },
  {
    date: '2022-02-04',
    remark: '初四',
  },
  {
    date: '2022-02-05',
    remark: '初五',
  },
  {
    date: '2022-02-06',
    remark: '初六',
  },
  {
    date: '2022-04-03',
    remark: '清明节',
  },
  {
    date: '2022-04-04',
    remark: '清明节',
  },
  {
    date: '2022-04-05',
    remark: '清明节',
  },
  {
    date: '2022-04-30',
    remark: '劳动节',
  },
  {
    date: '2022-05-01',
    remark: '劳动节',
  },
  {
    date: '2022-05-02',
    remark: '劳动节',
  },
  {
    date: '2022-05-03',
    remark: '劳动节',
  },
  {
    date: '2022-05-04',
    remark: '劳动节',
  },
  {
    date: '2022-06-03',
    remark: '端午节',
  },
  {
    date: '2022-06-04',
    remark: '端午节',
  },
  {
    date: '2022-06-05',
    remark: '端午节',
  },
  {
    date: '2022-09-10',
    remark: '中秋节',
  },
  {
    date: '2022-09-11',
    remark: '中秋节',
  },
  {
    date: '2022-09-12',
    remark: '中秋节',
  },
  {
    date: '2022-10-01',
    remark: '国庆节',
  },
  {
    date: '2022-10-02',
    remark: '国庆节',
  },
  {
    date: '2022-10-03',
    remark: '国庆节',
  },
  {
    date: '2022-10-04',
    remark: '国庆节',
  },
  {
    date: '2022-10-05',
    remark: '国庆节',
  },
  {
    date: '2022-10-06',
    remark: '国庆节',
  },
  {
    date: '2022-10-07',
    remark: '国庆节',
  },
  {
    date: '2022-12-31',
    remark: '元旦(周六)',
  },
  {
    date: '2023-01-01',
    remark: '元旦',
  },
  {
    date: '2023-01-02',
    remark: '元旦',
  },
  {
    date: '2023-01-21',
    remark: '除夕',
  },
  {
    date: '2023-01-22',
    remark: '初一',
  },
  {
    date: '2023-01-23',
    remark: '初二',
  },
  {
    date: '2023-01-24',
    remark: '初三',
  },
  {
    date: '2023-01-25',
    remark: '初四',
  },
  {
    date: '2023-01-26',
    remark: '初五',
  },
  {
    date: '2023-01-27',
    remark: '初六',
  },
  {
    date: '2023-04-05',
    remark: '清明节',
  },
  {
    date: '2023-04-29',
    remark: '劳动节',
  },
  {
    date: '2023-04-30',
    remark: '劳动节',
  },
  {
    date: '2023-05-01',
    remark: '劳动节',
  },
  {
    date: '2023-05-02',
    remark: '劳动节',
  },
  {
    date: '2023-05-03',
    remark: '劳动节',
  },
  {
    date: '2023-06-22',
    remark: '端午节',
  },
  {
    date: '2023-06-23',
    remark: '端午节',
  },
  {
    date: '2023-06-24',
    remark: '端午节',
  },
  {
    date: '2023-09-29',
    remark: '中秋节',
  },
  {
    date: '2023-09-30',
    remark: '中秋节',
  },
  {
    date: '2023-10-01',
    remark: '国庆节',
  },
  {
    date: '2023-10-02',
    remark: '国庆节',
  },
  {
    date: '2023-10-03',
    remark: '国庆节',
  },
  {
    date: '2023-10-04',
    remark: '国庆节',
  },
  {
    date: '2023-10-05',
    remark: '国庆节',
  },
  {
    date: '2023-10-06',
    remark: '国庆节',
  },
]

/** 2022-23 年节假日 */
export const work = [
  {
    date: '2022-01-29',
    remark: '春节前补班(周六)',
  },
  {
    date: '2022-01-30',
    remark: '春节前补班(周日)',
  },
  {
    date: '2022-04-02',
    remark: '清明节前补班(周六)',
  },
  {
    date: '2022-04-24',
    remark: '劳动节前补班(周日)',
  },
  {
    date: '2022-05-07',
    remark: '劳动节后补班(周六)',
  },
  {
    date: '2022-10-08',
    remark: '国庆节后补班(周六)',
  },
  {
    date: '2022-10-09',
    remark: '国庆节后补班(周日)',
  },
  {
    date: '2023-01-28',
    remark: '春节后补班(周六)',
  },
  {
    date: '2023-01-29',
    remark: '春节后补班(周日)',
  },
  {
    date: '2023-04-23',
    remark: '劳动节前补班(周日)',
  },
  {
    date: '2023-05-06',
    remark: '劳动节后补班(周六)',
  },
  {
    date: '2023-06-25',
    remark: '端午节后补班(周日)',
  },
  {
    date: '2023-10-07',
    remark: '国庆节后补班(周六)',
  },
  {
    date: '2023-10-08',
    remark: '国庆节后补班(周日)',
  },
]
